guikoller/EMB/Lab1GTI/LPC1768.inc
;***************************************************************************************
; Assembler Include File: Definition of peripheral registers for Cortex-M3 NXP LPC1768 *
; from: LPC176x,5x User manual (UM10360) v4.1    Pages: p.xxx/851                      *
; Hochschule Mannheim / Institut für Embedded Systems / Bernhard Pohlner               *
; Version 2019-1118                                                                    *
; for:                                                                                 *
; Chapter  4: LPC176x/5x Clocking and power control           p. 32/851                *
; Chapter  8: LPC176x/5x Pin connect block                    p.117/851                *
; Chapter  9: LPC176x/5x General Purpose Input/Output (GPIO)  p.132-139/851            *
; Chapter 14: LPC176x/5x UART0/2/3                            p.310/851                *
; Chapter 15: LPC176x/5x UART1                                p.330/851                *
; Chapter 21: LPC176x/5x Timer 0/1/2/3                        p.503/851                *
;***************************************************************************************
; Name		EQU	Address    ; Access		Reset Value		Description

; Chapter  4: LPC176x/5x Clocking and power control           p. 32/851

			; Clock source selection
CLKSRCSEL	EQU	0x400FC10C ; R/W 0  Clock Source Select Register
			; Phase Locked Loop (PLL0, Main PLL)
PLL0CON		EQU	0x400FC080 ; R/W 0  PLL0 Control Register
PLL0CFG		EQU	0x400FC084 ; R/W 0  PLL0 Configuration Register
PLL0STAT	EQU	0x400FC088 ; RO  0  PLL0 Status Register
PLL0FEED	EQU	0x400FC08C ; WO NA  PLL0 Feed Register
			; Phase Locked Loop (PLL1, USB PLL)
PLL1CON		EQU	0x400FC0A0 ; R/W 0  PLL1 Control Register
PLL1CFG		EQU	0x400FC0A4 ; R/W 0  PLL1 Configuration Register
PLL1STAT	EQU	0x400FC0A8 ; PLL1 Status Register RO 0
PLL1FEED	EQU	0x400FC0AC ; PLL1 Feed Register WO NA
			; Clock dividers
CCLKCFG		EQU	0x400FC104 ; R/W 0  CPU Clock Configuration Register
USBCLKCFG	EQU	0x400FC108 ; R/W 0  USB Clock Configuration Register
PCLKSEL0	EQU	0x400FC1A8 ; R/W 0  Peripheral Clock Selection register 0.
PCLKSEL1	EQU	0x400FC1AC ; R/W 0  Peripheral Clock Selection register 1.
			; Power control
PCON		EQU	0x400FC0C0 ; R/W 0  Power Control Register						p. 63/851
PCONP		EQU	0x400FC0C4 ; R/W 0x03BE  Power Control for Peripherals Register	p. 65/851
			; Utility
CLKOUTCFG	EQU	0x400FC1C8 ; R/W 0  Clock Output Configuration Register

; Chapter 8: LPC176x/5x Pin connect block  p.117/851

PINSEL0		EQU	0x4002C000 ; R/W 0  Pin function select register 0
PINSEL1		EQU	0x4002C004 ; R/W 0  Pin function select register 1
PINSEL2		EQU	0x4002C008 ; R/W 0  Pin function select register 2
PINSEL3		EQU	0x4002C00C ; R/W 0  Pin function select register 3
PINSEL4		EQU	0x4002C010 ; R/W 0  Pin function select register 4
PINSEL7		EQU	0x4002C01C ; R/W 0  Pin function select register 7
PINSEL8		EQU	0x4002C020 ; R/W 0  Pin function select register 8
PINSEL9		EQU	0x4002C024 ; R/W 0  Pin function select register 9
PINSEL10	EQU	0x4002C028 ; R/W 0  Pin function select register 10
PINMODE0	EQU	0x4002C040 ; R/W 0  Pin mode select register 0
PINMODE1	EQU	0x4002C044 ; R/W 0  Pin mode select register 1
PINMODE2	EQU	0x4002C048 ; R/W 0  Pin mode select register 2
PINMODE3	EQU	0x4002C04C ; R/W 0  Pin mode select register 3
PINMODE4	EQU	0x4002C050 ; R/W 0  Pin mode select register 4
PINMODE5	EQU	0x4002C054 ; R/W 0  Pin mode select register 5
PINMODE6	EQU	0x4002C058 ; R/W 0  Pin mode select register 6
PINMODE7	EQU	0x4002C05C ; R/W 0  Pin mode select register 7
PINMODE9	EQU	0x4002C064 ; R/W 0  Pin mode select register 9

PINMODE_OD0	EQU	0x4002C068 ; R/W 0  Open drain mode control register 0
PINMODE_OD1	EQU	0x4002C06C ; R/W 0  Open drain mode control register 1
PINMODE_OD2	EQU	0x4002C070 ; R/W 0  Open drain mode control register 2
PINMODE_OD3	EQU	0x4002C074 ; R/W 0  Open drain mode control register 3
PINMODE_OD4	EQU	0x4002C078 ; R/W 0  Open drain mode control register 4

I2CPADCFG	EQU	0x4002C07C ; R/W 0  I2C Pin Configuration register

; Chapter 9: LPC176x/5x General Purpose Input/Output (GPIO)  p.132/851

FIO0DIR		EQU	0x2009C000 ; R/W 0  FIODIR Fast GPIO Port Direction control register.
FIO1DIR		EQU	0x2009C020 ; This register individually controls the direction of each port pin.
FIO2DIR		EQU	0x2009C040
FIO3DIR		EQU	0x2009C060
FIO4DIR		EQU	0x2009C080

FIO0MASK	EQU	0x2009C010 ; R/W 0  FIOMASK Fast Mask register for port.
FIO1MASK	EQU	0x2009C030 ; Writes, sets, clears, and reads to port
FIO2MASK	EQU	0x2009C050 ; (done via writes to FIOPIN, FIOSET, and FIOCLR, and reads of FIOPIN)
FIO3MASK	EQU	0x2009C070 ; alter or return only the bits enabled by zeros in this register.
FIO4MASK	EQU	0x2009C090

FIO0PIN		EQU	0x2009C014 ; R/W 0  FIOPIN Fast Port Pin value register using FIOMASK.
FIO1PIN		EQU	0x2009C034 ; The current state of digital port pins can be read from this register,
FIO2PIN		EQU	0x2009C054 ; regardless of pin direction or alternate function selection
FIO3PIN		EQU	0x2009C074 ; (as long as pins are not configured as an input to ADC).
FIO4PIN		EQU	0x2009C094 ; The value read is masked by ANDing with inverted FIOMASK.
			; Writing to this register places corresponding values in all bits enabled by zeros in FIOMASK.
			;
			; Important: if an FIOPIN register is read, its bit(s) masked with 1 in the FIOMASK register
			; will be read as 0 regardless of the physical pin state.

FIO0SET		EQU	0x2009C018 ; R/W 0  FIOSET Fast Port Output Set register using FIOMASK.
FIO1SET		EQU	0x2009C038 ; This register controls the state of output pins.
FIO2SET		EQU	0x2009C058 ; Writing 1s produces highs at the corresponding port pins.
FIO3SET		EQU	0x2009C078 ; Writing 0s has no effect.
FIO4SET		EQU	0x2009C098 ; Only bits enabled by 0 in FIOMASK can be altered.
			; Reading this register returns the current contents of the port output register.

FIO0CLR		EQU	0x2009C01C ; WO  0  FIOCLR Fast Port Output Clear register using FIOMASK.
FIO1CLR		EQU	0x2009C03C ; This register controls the state of output pins.
FIO2CLR		EQU	0x2009C05C ; Writing 1s produces lows at the corresponding port pins.
FIO3CLR		EQU	0x2009C07C ; Writing 0s has no effect.
FIO4CLR		EQU	0x2009C09C ; Only bits enabled by 0 in FIOMASK can be altered.


