guikoller/EMB/Lab1GTI/LPC1768.inc
; Chapter 9: LPC176x/5x General Purpose Input/Output (GPIO)  p.133/851


IO0IntEnR	EQU	0x40028090 ; R/W 0  IntEnR GPIO Interrupt Enable for Rising edge.
IO2IntEnR	EQU	0x400280B0

IO0IntEnF	EQU	0x40028094 ; R/W 0  IntEnF GPIO Interrupt Enable for Falling edge.  Druckfehler: IO0IntEnR
IO2IntEnF	EQU	0x400280B4 ;                                                                    IO2IntEnR

IO0IntStatR	EQU	0x40028084 ; RO  0  IntStatR GPIO Interrupt Status for Rising edge.
IO2IntStatR	EQU	0x400280A4

IO0IntStatF	EQU	0x40028088 ; RO  0  IntStatF GPIO Interrupt Status for Falling edge.
IO2IntStatF	EQU	0x400280A8

IO0IntClr	EQU	0x4002808C ; WO  0  IntClr GPIO Interrupt Clear.
IO2IntClr	EQU	0x400280AC

IOIntStatus	EQU	0x40028080 ; RO  0  IntStatus GPIO overall Interrupt Status.


; Chapter 9: LPC176x/5x General Purpose Input/Output (GPIO)  p.134/851


FIO0DIR0	EQU	0x2009C000 ; R/W 0x00  FIOxDIR0 Fast GPIO Port x Direction control register 0.
FIO1DIR0	EQU	0x2009C020 ; Bit 0 in FIOxDIR0 register corresponds to pin Px.0 … bit 7 to pin Px.7.
FIO2DIR0	EQU	0x2009C040 ; 8 (byte)
FIO3DIR0	EQU	0x2009C060
FIO4DIR0	EQU	0x2009C080

FIO0DIR1	EQU	0x2009C001 ; R/W 0x00  FIOxDIR1 Fast GPIO Port x Direction control register 1.
FIO1DIR1	EQU	0x2009C021 ; Bit 0 in FIOxDIR1 register corresponds to pin Px.8 … bit 7 to pin Px.15.
FIO2DIR1	EQU	0x2009C041 ; 8 (byte)
FIO3DIR1	EQU	0x2009C061
FIO4DIR1	EQU	0x2009C081

FIO0DIR2	EQU	0x2009C002 ; R/W 0x00  FIOxDIR2 Fast GPIO Port x Direction control register 2.
FIO1DIR2	EQU	0x2009C022 ; Bit 0 in FIOxDIR2 register corresponds to pin Px.16 … bit 7 to pin Px.23.
FIO2DIR2	EQU	0x2009C042 ; 8 (byte)
FIO3DIR2	EQU	0x2009C062
FIO4DIR2	EQU	0x2009C082

FIO0DIR3	EQU	0x2009C003 ; R/W 0x00  FIOxDIR3 Fast GPIO Port x Direction control register 3.
FIO1DIR3	EQU	0x2009C023 ; Bit 0 in FIOxDIR3 register corresponds to pin Px.24 … bit 7 to pin Px.31.
FIO2DIR3	EQU	0x2009C043 ; 8 (byte)
FIO3DIR3	EQU	0x2009C063
FIO4DIR3	EQU	0x2009C083

FIO0DIRL	EQU	0x2009C000 ; R/W 0x0000  FIOxDIRL Fast GPIO Port x Direction control Lower half-word register.
FIO1DIRL	EQU	0x2009C020 ; Bit 0 in FIOxDIRL register corresponds to pin Px.0 … bit 15 to pin Px.15.
FIO2DIRL	EQU	0x2009C040 ; 16 (half-word)
FIO3DIRL	EQU	0x2009C060
FIO4DIRL	EQU	0x2009C080

FIO0DIRU	EQU	0x2009C002 ; R/W 0x0000  FIOxDIRU Fast GPIO Port x Direction control Upper half-word register.
FIO1DIRU	EQU	0x2009C022 ; Bit 0 in FIOxDIRU register corresponds to Px.16 … bit 15 to Px.31.
FIO2DIRU	EQU	0x2009C042 ; 16 (half-word)
FIO3DIRU	EQU	0x2009C062
FIO4DIRU	EQU	0x2009C082

; Chapter 9: LPC176x/5x General Purpose Input/Output (GPIO)  p.135/851

FIO0SET0	EQU	0x2009C018 ; R/W 0x00  FIOxSET0 Fast GPIO Port x output Set register 0.
FIO1SET0	EQU	0x2009C038 ; Bit 0 in FIOxSET0 register corresponds to pin Px.0 … bit 7 to pin Px.7.
FIO2SET0	EQU	0x2009C058 ; 8 (byte)
FIO3SET0	EQU	0x2009C078
FIO4SET0	EQU	0x2009C098

FIO0SET1	EQU	0x2009C019 ; R/W 0x00  FIOxSET1 Fast GPIO Port x output Set register 1.
FIO1SET1	EQU	0x2009C039 ; Bit 0 in FIOxSET1 register corresponds to pin Px.8 … bit 7 to pin Px.15.
FIO2SET1	EQU	0x2009C059 ; 8 (byte)
FIO3SET1	EQU	0x2009C079
FIO4SET1	EQU	0x2009C099

FIO0SET2	EQU	0x2009C01A ; R/W 0x00  FIOxSET2 Fast GPIO Port x output Set register 2.
FIO1SET2	EQU	0x2009C03A ; Bit 0 in FIOxSET2 register corresponds to pin Px.16 … bit 7 to pin Px.23.
FIO2SET2	EQU	0x2009C05A ; 8 (byte)
FIO3SET2	EQU	0x2009C07A
FIO4SET2	EQU	0x2009C09A

FIO0SET3	EQU	0x2009C01B ; R/W 0x00  FIOxSET3 Fast GPIO Port x output Set register 3.
FIO1SET3	EQU	0x2009C03B ; Bit 0 in FIOxSET3 register corresponds to pin Px.24 … bit 7 to pin Px.31.
FIO2SET3	EQU	0x2009C05B ; 8 (byte)
FIO3SET3	EQU	0x2009C07B
FIO4SET3	EQU	0x2009C09B

FIO0SETL	EQU	0x2009C018 ; R/W 0x0000  FIOxSETL Fast GPIO Port x output Set Lower half-word register.
FIO1SETL	EQU	0x2009C038 ; Bit 0 in FIOxSETL register corresponds to pin Px.0 … bit 15 to pin Px.15.
FIO2SETL	EQU	0x2009C058 ; 16 (half-word)
FIO3SETL	EQU	0x2009C078
FIO4SETL	EQU	0x2009C098

FIO0SETU	EQU	0x2009C01A ; R/W 0x0000  FIOxSETU Fast GPIO Port x output Set Upper half-word register.
FIO1SETU	EQU	0x2009C03A ; Bit 0 in FIOxSETU register corresponds to Px.16 … bit 15 to Px.31.
FIO2SETU	EQU	0x2009C05A ; 16 (half-word)
FIO3SETU	EQU	0x2009C07A
FIO4SETU	EQU	0x2009C09A

; Chapter 9: LPC176x/5x General Purpose Input/Output (GPIO)  p.136+137/851

FIO0CLR0	EQU	0x2009C01C ; WO  0x00  FIOxCLR0 Fast GPIO Port x output Clear register 0.
FIO1CLR0	EQU	0x2009C03C ; Bit 0 in FIOxCLR0 register corresponds to pin Px.0 … bit 7 to pin Px.7.
FIO2CLR0	EQU	0x2009C05C ; 8 (byte)
FIO3CLR0	EQU	0x2009C07C
FIO4CLR0	EQU	0x2009C09C

FIO0CLR1	EQU	0x2009C01D ; WO  0x00  FIOxCLR1 Fast GPIO Port x output Clear register 1.
FIO1CLR1	EQU	0x2009C03D ; Bit 0 in FIOxCLR1 register corresponds to pin Px.8 … bit 7 to pin Px.15.
FIO2CLR1	EQU	0x2009C05D ; 8 (byte)
FIO3CLR1	EQU	0x2009C07D
FIO4CLR1	EQU	0x2009C09D

FIO0CLR2	EQU	0x2009C01E ; WO  0x00  FIOxCLR2 Fast GPIO Port x output Clear register 2.
FIO1CLR2	EQU	0x2009C03E ; Bit 0 in FIOxCLR2 register corresponds to pin Px.16 … bit 7 to pin Px.23.
FIO2CLR2	EQU	0x2009C05E ; 8 (byte)
FIO3CLR2	EQU	0x2009C07E
FIO4CLR2	EQU	0x2009C09E

FIO0CLR3	EQU	0x2009C01F ; WO  0x00  FIOxCLR3 Fast GPIO Port x output
FIO1CLR3	EQU	0x2009C03F ; Clear register 3. Bit 0 in FIOxCLR3 register corresponds to pin Px.24 … bit 7 to pin Px.31.
FIO2CLR3	EQU	0x2009C05F ; 8 (byte)
FIO3CLR3	EQU	0x2009C07F
FIO4CLR3	EQU	0x2009C09F

FIO0CLRL	EQU	0x2009C01C ; WO  0x0000  FIOxCLRL Fast GPIO Port x output Clear Lower half-word register.
FIO1CLRL	EQU	0x2009C03C ; Bit 0 in FIOxCLRL register corresponds to pin Px.0 … bit 15 to pin Px.15.
FIO2CLRL	EQU	0x2009C05C ; 16 (half-word)
FIO3CLRL	EQU	0x2009C07C
FIO4CLRL	EQU	0x2009C09C

FIO0CLRU	EQU	0x2009C01E ; WO  0x0000  FIOxCLRU Fast GPIO Port x output eaClr Upper half-word register.
FIO1CLRU	EQU	0x2009C03E ; Bit 0 in FIOxCLRU register corresponds to pin Px.16 … bit 15 to Px.31.
FIO2CLRU	EQU	0x2009C05E ; 16 (half-word)
FIO3CLRU	EQU	0x2009C07E
FIO4CLRU	EQU	0x2009C09E

; Chapter 9: LPC176x/5x General Purpose Input/Output (GPIO)  p.138+139/851

