guikoller/EMB/Lab1GTI/LPC1768.inc
FIO0PIN0	EQU	0x2009C014 ; R/W 0x00  FIOxPIN0 Fast GPIO Port x Pin value register 0.
FIO1PIN0	EQU	0x2009C034 ; Bit 0 in FIOxPIN0 register corresponds to pin Px.0 … bit 7 to pin Px.7.
FIO2PIN0	EQU	0x2009C054 ; 8 (byte)
FIO3PIN0	EQU	0x2009C074
FIO4PIN0	EQU	0x2009C094

FIO0PIN1	EQU	0x2009C015 ; R/W 0x00  FIOxPIN1 Fast GPIO Port x Pin value register 1.
FIO1PIN1	EQU	0x2009C035 ; Bit 0 in FIOxPIN1 register corresponds to pin Px.8 … bit 7 to pin Px.15.
FIO2PIN1	EQU	0x2009C055 ; 8 (byte)
FIO3PIN1	EQU	0x2009C075
FIO4PIN1	EQU	0x2009C095

FIO0PIN2	EQU	0x2009C016 ; R/W 0x00  FIOxPIN2 Fast GPIO Port x Pin value register 2.
FIO1PIN2	EQU	0x2009C036 ; Bit 0 in FIOxPIN2 register corresponds to pin Px.16 … bit 7 to pin Px.23.
FIO2PIN2	EQU	0x2009C056 ; 8 (byte)
FIO3PIN2	EQU	0x2009C076
FIO4PIN2	EQU	0x2009C096

FIO0PIN3	EQU	0x2009C017 ; R/W 0x00  FIOxPIN3 Fast GPIO Port x Pin value register 3.
FIO1PIN3	EQU	0x2009C037 ; Bit 0 in FIOxPIN3 register corresponds to pin Px.24 … bit 7 to pin Px.31.
FIO2PIN3	EQU	0x2009C057 ; 8 (byte)
FIO3PIN3	EQU	0x2009C077
FIO4PIN3	EQU	0x2009C097

FIO0PINL	EQU	0x2009C014 ; R/W 0x0000  FIOxPINL Fast GPIO Port x Pin value Lower half-word register.
FIO1PINL	EQU	0x2009C034 ; Bit 0 in FIOxPINL register corresponds to pin Px.0 … bit 15 to pin Px.15.
FIO2PINL	EQU	0x2009C054 ; 16 (half-word)
FIO3PINL	EQU	0x2009C074
FIO4PINL	EQU	0x2009C094

FIO0PINU	EQU	0x2009C016 ; R/W 0x0000  FIOxPINU Fast GPIO Port x Pin value Upper half-word register.
FIO1PINU	EQU	0x2009C036 ; Bit 0 in FIOxPINU register corresponds to pin Px.16 … bit 15 to Px.31.
FIO2PINU	EQU	0x2009C056 ; 16 (half-word)
FIO3PINU	EQU	0x2009C076
FIO4PINU	EQU	0x2009C096

; Chapter 9: LPC176x/5x General Purpose Input/Output (GPIO)  p.138+139/851

FIO0MASK0	EQU	0x2009C010 ; R/W 0x0  FIOxMASK0 Fast GPIO Port x Mask register 0.
FIO1MASK0	EQU	0x2009C030 ; Bit 0 in FIOxMASK0 register corresponds to pin Px.0 … bit 7 to pin Px.7.
FIO2MASK0	EQU	0x2009C050 ; 8 (byte)
FIO3MASK0	EQU	0x2009C070
FIO4MASK0	EQU	0x2009C090

FIO0MASK1	EQU	0x2009C011 ; R/W 0x0  FIOxMASK1 Fast GPIO Port x Mask register 1.
FIO1MASK1	EQU	0x2009C031 ; Bit 0 in FIOxMASK1 register corresponds to pin Px.8 … bit 7 to pin Px.15.
FIO2MASK1	EQU	0x2009C051 ; 8 (byte)
FIO3MASK1	EQU	0x2009C071
FIO4MASK1	EQU	0x2009C091

FIO0MASK2	EQU	0x2009C012 ; R/W 0x0  FIOxMASK2 Fast GPIO Port x Mask register 2.
FIO1MASK2	EQU	0x2009C032 ; Bit 0 in FIOxMASK2 register corresponds to pin Px.16 … bit 7 to pin Px.23.
FIO2MASK2	EQU	0x2009C052 ; 8 (byte)
FIO3MASK2	EQU	0x2009C072
FIO4MASK2	EQU	0x2009C092

FIO0MASK3	EQU	0x2009C013 ; R/W 0x0  FIOxMASK3 Fast GPIO Port x Mask register 3.
FIO1MASK3	EQU	0x2009C033 ; Bit 0 in FIOxMASK3 register corresponds to pin Px.24 … bit 7 to pin Px.31.
FIO2MASK3	EQU	0x2009C053 ; 8 (byte)
FIO3MASK3	EQU	0x2009C073
FIO4MASK3	EQU	0x2009C093

FIO0MASKL	EQU	0x2009C010 ; R/W 0x0  FIOxMASKL Fast GPIO Port x Mask Lower half-word register.
FIO1MASKL	EQU	0x2009C030 ; Bit 0 in FIOxMASKL register corresponds to pin Px.0 … bit 15 to pin Px.15.
FIO2MASKL	EQU	0x2009C050 ; 16 (half-word)
FIO3MASKL	EQU	0x2009C070
FIO4MASKL	EQU	0x2009C090

FIO0MASKU	EQU	0x2009C012 ; R/W 0x0  FIOxMASKU Fast GPIO Port x Mask Upper half-word register.
FIO1MASKU	EQU	0x2009C032 ; Bit 0 in FIOxMASKU register corresponds to pin Px.16 … bit 15 to Px.31.
FIO2MASKU	EQU	0x2009C052 ; 16 (half-word)
FIO3MASKU	EQU	0x2009C072
FIO4MASKU	EQU	0x2009C092

; Chapter 14: LPC176x/5x UART0/2/3  p.310/851

U0RBR		EQU	0x4000C000 ; RO  NA    RBR (when DLAB =0) Receiver Buffer Register.
U2RBR		EQU	0x40098000 ; Contains the next received character to be read.
U3RBR		EQU	0x4009C000 ; RBR 7:0  contains the oldest received byte in the UARTn Rx FIFO.  p.311/851

U0THR		EQU	0x4000C000 ; WO  NA    THR (when DLAB =0) Transmit Holding Register.
U2THR		EQU	0x40098000 ; The next character to be transmitted is written here.
U3THR		EQU	0x4009C000 ; THR 7:0  Writing causes the data to be stored in the UARTn transmit FIFO.
			; The byte will be sent when it reaches the bottom of the FIFO and the transmitter is available.  p.311/851

U0DLL		EQU	0x4000C000 ; R/W 0x01  DLL (when DLAB =1) Divisor Latch LSB.
U2DLL		EQU	0x40098000 ; Least significant byte of the baud rate divisor value.
U3DLL		EQU	0x4009C000 ; The full divisor is used to generate a baud rate from the fractional rate divider.
			; UnDLL:  DLLSB 7:0  Divisor Latch LSB  p.312/851

U0DLM		EQU	0x4000C004 ; R/W 0x00  DLM (when DLAB =1) Divisor Latch MSB.
U2DLM		EQU	0x40098004 ; Most significant byte of the baud rate divisor value.
U3DLM		EQU	0x4009C004 ; The full divisor is used to generate a baud rate from the fractional rate divider.
			; UnDLM:  DLMSB 7:0  Divisor Latch MSB  p.312/851

U0IER		EQU	0x4000C004 ; R/W 0x00  IER (when DLAB =0) Interrupt Enable Register.
U2IER		EQU	0x40098004 ; Contains individual interrupt enable bits for the 7 potential UART interrupts.
U3IER		EQU	0x4009C004 ;
			; IER:  ABTOIntEn 9   ABEOIntEn 8   Reserved 7:3   RX Line Status Interrupt Enable 2   THRE Interrupt Enable 1   RBR Interrupt Enable 0  p.312/851

U0IIR		EQU	0x4000C008 ; RO  0x01  IIR Interrupt ID Register.
U2IIR		EQU	0x40098008 ; Identifies which interrupt(s) are pending.
U3IIR		EQU	0x4009C008 ; IIR:  ABTOInt 9   ABEOInt 8   FIFO Enable 7:6   Reserved 5:4   IntId 3:1   IntStatus 0  p.313/851

U0FCR		EQU	0x4000C008 ; WO  0x00  FCR FIFO Control Register.
U2FCR		EQU	0x40098008 ; Controls UART FIFO usage and modes.
U3FCR		EQU	0x4009C008 ; FCR:  RX Trigger 7:6   Reserved 5:4
			; DMA Mode Select 3   TX FIFO Reset 2   RX FIFO Reset 1   FIFO Enable 0  p.315/851

U0LCR		EQU	0x4000C00C ; R/W 0x00  LCR Line Control Register.
U2LCR		EQU	0x4009800C ; Contains controls for frame formatting and break generation.
U3LCR		EQU	0x4009C00C ; LCR:  Divisor Latch Access Bit (DLAB) 7   Break Control 6   Parity Select 5:4
			; Parity Enable 3   Stop Bit Select 2   Word Length Select 1:0
			; Word Length Select: 00=5-bit character length ... 11=8-bit character length  p.316/851

U0LSR		EQU	0x4000C014 ; RO  0x60  LSR Line Status Register.
U2LSR		EQU	0x40098014 ; Contains flags for transmit and receive status, including line errors.
U3LSR		EQU	0x4009C014 ; LSR:  Error in RX FIFO (RXFE) 7   Transmitter Empty (TEMT) 6   Transmitter Holding Register Empty (THRE)) 5   Break Interrupt (BI) 4
			; Framing Error (FE) 3   Parity Error (PE) 2   Overrun Error (OE) 1   Receiver Data Ready (RDR) 0  p.316-318/851

U0SCR		EQU	0x4000C01C ; R/W 0x00  SCR Scratch Pad Register.
U2SCR		EQU	0x4009801C ; 8-bit temporary storage for software.
U3SCR		EQU	0x4009C01C ; SCR:  Pad 7:0  A readable, writable byte.  p.318/851

