guikoller/EMB/Lab1GTI/LPC1768.inc
U0ACR		EQU	0x4000C020 ; R/W 0x00  ACR Auto-baud Control Register.
U2ACR		EQU	0x40098020 ; Contains controls for the auto-baud feature.
U3ACR		EQU	0x4009C020 ; ACR:  AutoRestart 2   Mode 1   Start 0  p.316-318/851

U0ICR		EQU	0x4000C024 ; R/W 0x00  ICR IrDA Control Register.
U2ICR		EQU	0x40098024 ; Enables and configures the IrDA mode.
U3ICR		EQU	0x4009C024 ;

U0FDR		EQU	0x4000C028 ; R/W 0x10  FDR Fractional Divider Register.
U2FDR		EQU	0x40098028 ; Generates a clock input for the baud rate divider.
U3FDR		EQU	0x4009C028 ;

U0TER		EQU	0x4000C030 ; R/W 0x80  TER Transmit Enable Register.
U2TER		EQU	0x40098030 ; Turns off UART transmitter for use with software flow control.
U3TER		EQU	0x4009C030 ;

; Chapter 15: LPC176x/5x UART1  p.330/851

U1RBR		EQU	0x40010000 ; RO NA  RBR (when DLAB =0) Receiver Buffer Register.
						   ; Contains the next received character to be read.

U1THR		EQU	0x40010000 ; WO NA  THR (when DLAB =0) Transmit Holding Register.
						   ; The next character to be transmitted is written here.

U1DLL		EQU	0x40010000 ; R/W 0x01  DLL (when DLAB =1) Divisor Latch LSB.
						   ; Least significant byte of the baud rate divisor value.
						   ; The full divisor is used to generate a baud rate from the fractional rate divider.

U1DLM		EQU	0x40010004 ; R/W 0x00  DLM (when DLAB =1) Divisor Latch MSB.
						   ; Most significant byte of the baud rate divisor value.
						   ; The full divisor is used to generate a baud rate from the fractional rate divider.

U1IER		EQU	0x40010004 ; R/W 0x00  IER (when DLAB =0) Interrupt Enable Register.
						   ; Contains individual interrupt enable bits for the 7 potential UART1 interrupts.

U1IIR		EQU	0x40010008 ; RO 0x01  IIR	Interrupt ID Register.
						   ; Identifies which interrupt(s) are pending.

U1FCR		EQU	0x40010008 ; WO 0x00  FIFO Control Register. Controls UART1 FIFO usage and modes.

U1LCR		EQU	0x4001000C ; R/W 0x00  LCR Line Control Register.
						   ; Contains controls for frame formatting and break generation.

U1MCR		EQU	0x40010010 ; R/W 0x00  MCR Modem Control Register.
						   ; Contains controls for flow control handshaking and loopback mode.

U1LSR		EQU	0x40010014 ; RO  0x60  LSR Line Status Register.
						   ; Contains flags for transmit and receive status, including line errors.

U1MSR		EQU	0x40010018 ; RO 0x00  MSR Modem Status Register.
						   ; Contains handshake signal status flags.

U1SCR		EQU	0x4001001C ; R/W 0x00  SCR Scratch Pad Register. 8-bit temporary storage for software.

U1ACR		EQU	0x40010020 ; R/W 0x00  ACR Auto-baud Control Register.
						   ; Contains controls for the auto-baud feature.

U1FDR		EQU	0x40010028 ; R/W 0x10  FDR Fractional Divider Register.
						   ; Generates a clock input for the baud rate divider.

U1TER		EQU	0x40010030 ; R/W 0x80  TER Transmit Enable Register.
						   ; Turns off UART transmitter for use with software flow control.

U1RS485CTRL	EQU	0x4001004C ; R/W 0x00  RS-485/EIA-485 Control.
						   ; Contains controls to configure various aspects of RS-485/EIA-485 modes.

U1ADRMATCH	EQU	0x40010050 ; R/W 0x00  RS-485/EIA-485 address match.
						   ; Contains the address match value for RS-485/EIA-485 mode.

U1RS485DLY	EQU	0x40010054 ; R/W 0x00  RS-485/EIA-485 direction control delay.

; Chapter 21: LPC176x/5x Timer 0/1/2/3                        p.503/851

T0IR	EQU	0x40004000 ; R/W 0  IR Interrupt Register.
T1IR	EQU	0x40008000 ; The IR can be written to clear interrupts.
T2IR	EQU	0x40090000 ; The IR can be read to identify
T3IR	EQU	0x40094000 ; which of eight possible interrupt sources are pending.

T0TCR	EQU	0x40004004 ; R/W 0  TCR Timer Control Register.
T1TCR	EQU	0x40008004 ; The TCR is used to control the Timer Counter functions.
T2TCR	EQU	0x40090004 ; The Timer Counter can be disabled or reset through the TCR.
T3TCR	EQU	0x40094004 ;

T0TC	EQU	0x40004008 ; R/W 0  TC Timer Counter.
T1TC	EQU	0x40008008 ; The 32-bit TC is incremented every PR+1 cycles of PCLK.
T2TC	EQU	0x40090008 ; The TC is controlled through the TCR.
T3TC	EQU	0x40094008 ;

T0PR	EQU	0x4000400C ; R/W 0  PR Prescale Register.
T1PR	EQU	0x4000800C ; When the Prescale Counter (below) is equal to this value,
T2PR	EQU	0x4009000C ; the next clock increments the TC and clears the PC.
T3PR	EQU	0x4009400C ;

T0PC	EQU	0x40004010 ; R/W 0  PC Prescale Counter.
T1PC	EQU	0x40008010 ; The 32-bit PC is a counter which is incremented to the value stored in PR.
T2PC	EQU	0x40090010 ; When the value in PR is reached, the TC is incremented and the PC is cleared.
T3PC	EQU	0x40094010 ; The PC is observable and controllable through the bus interface.

T0MCR	EQU	0x40004014 ; R/W 0  MCR Match Control Register.
T1MCR	EQU	0x40008014 ; The MCR is used to control if an interrupt is generated
T2MCR	EQU	0x40090014 ; and if the TC is reset when a Match occurs.
T3MCR	EQU	0x40094014 ;

T0MR0	EQU	0x40004018 ; R/W 0  MR0 Match Register 0.
T1MR0	EQU	0x40008018 ; MR0 can be enabled through the MCR to reset the TC, stop both the TC and PC,
T2MR0	EQU	0x40090018 ; and/or generate an interrupt every time MR0 matches the TC.
T3MR0	EQU	0x40094018 ;

T0MR1	EQU	0x4000401C ; R/W 0  MR1 Match Register 1.
T1MR1	EQU	0x4000801C ; See MR0 description.
T2MR1	EQU	0x4009001C ;
T3MR1	EQU	0x4009401C ;

T0MR2	EQU	0x40004020 ; R/W 0  MR2 Match Register 2.
T1MR2	EQU	0x40008020 ; See MR0 description.
T2MR2	EQU	0x40090020 ;
T3MR2	EQU	0x40094020 ;

T0MR3	EQU	0x40004024 ; R/W 0  MR3 Match Register 3.
T1MR3	EQU	0x40008024 ; See MR0 description.
T2MR3	EQU	0x40090024 ;
T3MR3	EQU	0x40094024 ;

T0CCR	EQU	0x40004028 ; R/W 0  CCR Capture Control Register.
T1CCR	EQU	0x40008028 ; The CCR controls which edges of the capture inputs are used
T2CCR	EQU	0x40090028 ; to load the Capture Registers and whether
T3CCR	EQU	0x40094028 ; or not an interrupt is generated when a capture takes place.

T0CR0	EQU	0x4000402C ; RO 0  CR0 Capture Register 0.
T1CR0	EQU	0x4000802C ; CR0 is loaded with the value of TC when there is an event
T2CR0	EQU	0x4009002C ; on the CAPn.0 (CAP0.0 or CAP1.0 respectively) input.
T3CR0	EQU	0x4009402C ;

T0CR1	EQU	0x40004030 ; RO 0  CR1 Capture Register 1.
T1CR1	EQU	0x40008030 ; See CR0 description.
T2CR1	EQU	0x40090030 ;
T3CR1	EQU	0x40094030 ;

T0EMR	EQU	0x4000403C ; R/W 0  EMR External Match Register.
T1EMR	EQU	0x4000803C ; The EMR controls the external match pins
T2EMR	EQU	0x4009003C ; MATn.0-3 (MAT0.0-3 and MAT1.0-3 respectively).
T3EMR	EQU	0x4009403C ;

T0CTCR	EQU	0x40004070 ; R/W 0  CTCR Count Control Register.
T1CTCR	EQU	0x40008070 ; The CTCR selects between Timer and Counter mode,
T2CTCR	EQU	0x40090070 ; and in Counter mode selects the signal and edge(s) for counting.
T3CTCR	EQU	0x40094070 ;


	END